import { Component } from "@angular/core";
import { Menu } from "./menu.interface";

@Component({
    selector: 'app-footMenu',
    templateUrl: './footerMenu.component.html',
    styleUrls: ['./footerMenu.component.css']
})
export class FooterMenuComponent {

    // ???????????????????
    // navBar: Menu[] = [
    //     {
    //         title: 'Հեռուստացույցներ, աուդիո և վիդեոտեխնիկա',
    //         subMenu: [
    //             {
    //                 subTitle: 'Հեռուստացույցներ',
    //                 text: [
    //                     'UHD (4K) հեռուստացույցներ','UHD (4K) հեռուստացույցներ',
    //                     'Smart հեռուստացույցներ', 'QLED հեռուստացույցներ', 'OLED հեռուստացույցներ',
    //                     'NanoCell հեռուստացույցներ', 'QNED հեռուստացույցներ'

    //                 ]
    //             },
    //             {
    //                 subTitle: 'Պրոյեկտորներ և աքսեսուարներ',
    //                 text: [
    //                     'Պրոյեկտորներ', 'Պրոյեկտորի աքսեսուարներ/Տեսապրոյեկտորների էկրաններ',
    //                     'Հեռակառավարման վահանակներ']
    //             },
    //             {
    //                 subTitle: 'Տնային կինոթատրոններ և սաունդբարեր',
    //                 text: ['Սաունդբարեր', 'Տնային կինոթատրոններ']
    //             },
    //             {
    //                 subTitle: 'Երաժշտական կենտրոններ, MP3 նվագարկիչներ, ձայնագրիչներ',
    //                 text: [
    //                     'Երաժշտական կենտրոններ Midi', 'Երաժշտական կենտրոններ Micro',
    //                     'Երաժշտական կենտրոններ Micro', 'Երաժշտական կենտրոններ Mini',
    //                     'Վինիլային սկավառակի նվագարկիչներ']
    //             },
    //             {
    //                 subTitle: 'Ակուստիկա և բարձրախոսներ',
    //                 text: [
    //                     'Ակուստիկա', 'Համակարգային բարձրախոսներ', 'Շարժական բարձրախոսներ',
    //                     'Ընդունիչներ']
    //             },
    //             {
    //                 subTitle: 'Թվային հեռուստատեսություն և պարագաներ',
    //                 text: ['DVB-T2 ընդունիչներ', 'Smart TV համակարգեր', 'Տակդիրներ',
    //                     'Հենակներ', 'Հեռակառավարման վահանակներ', 'Աուդիո տեխնիկայի փոխարկիչներ',
    //                     'Մաքրող միջոցներ', 'Խոսափողներ', 'Տեսասարքերի մալուխներ և ալեհավաքներ',
    //                     'Տեսասարքերի փոխարկիչներ'
    //                 ]
    //             }

    //         ]
    //     },
    //     {
    //         title: 'Համակարգիչներ, նոթբուքներ, պլանշետներ',
    //         subMenu: [
    //             {
    //                 subTitle: '',
    //                 text: []
    //             }
    //         ]
    //     }


    // ];


    navBar = ['ԿԱՏԱԼՈԳ', 'Հեռուստացույցներ, աուդիո և վիդեոտեխնիկա',
        'Համակարգիչներ, նոթբուքներ, պլանշետներ', 'Հեռախոսներ և կապի միջոցներ',
        'Կենցաղային տեխնիկա', 'Խոհանոցային տեխնիկա', 'Կլիմատիկ տեխնիկա'];


    brandImgs = ['https://www.zigzag.am/pub/media/categories/miele.svg',
        'https://www.zigzag.am/pub/media/categories/bosch.svg',
        'https://www.zigzag.am/pub/media/categories/k-array.svg']



}