import { Component, OnInit } from "@angular/core";
import { Menu } from "./menu.interface";

@Component({
    selector: 'app-footMenu',
    templateUrl: './footerMenu.component.html',
    styleUrls: ['./footerMenu.component.css']
})
export class FooterMenuComponent {

    navBar: Menu[] = [
        {
            title: 'Հեռուստացույցներ, աուդիո և վիդեոտեխնիկա',
            subMenu: [
                {
                    subTitle: 'Հեռուստացույցներ',
                    text: [
                        'UHD (4K) հեռուստացույցներ', 'UHD (4K) հեռուստացույցներ',
                        'Smart հեռուստացույցներ', 'QLED հեռուստացույցներ', 'OLED հեռուստացույցներ',
                        'NanoCell հեռուստացույցներ', 'QNED հեռուստացույցներ'

                    ]
                },
                {
                    subTitle: 'Պրոյեկտորներ և աքսեսուարներ',
                    text: [
                        'Պրոյեկտորներ', 'Պրոյեկտորի աքսեսուարներ/Տեսապրոյեկտորների էկրաններ',
                        'Հեռակառավարման վահանակներ']
                },
                {
                    subTitle: 'Տնային կինոթատրոններ և սաունդբարեր',
                    text: ['Սաունդբարեր', 'Տնային կինոթատրոններ']
                },
                {
                    subTitle: 'Երաժշտական կենտրոններ, MP3 նվագարկիչներ, ձայնագրիչներ',
                    text: [
                        'Երաժշտական կենտրոններ Midi', 'Երաժշտական կենտրոններ Micro',
                        'Երաժշտական կենտրոններ Micro', 'Երաժշտական կենտրոններ Mini',
                        'Վինիլային սկավառակի նվագարկիչներ']
                },
                {
                    subTitle: 'Ակուստիկա և բարձրախոսներ',
                    text: [
                        'Ակուստիկա', 'Համակարգային բարձրախոսներ', 'Շարժական բարձրախոսներ',
                        'Ընդունիչներ']
                },
                {
                    subTitle: 'Թվային հեռուստատեսություն և պարագաներ',
                    text: ['DVB-T2 ընդունիչներ', 'Smart TV համակարգեր', 'Տակդիրներ',
                        'Հենակներ', 'Հեռակառավարման վահանակներ', 'Աուդիո տեխնիկայի փոխարկիչներ',
                        'Մաքրող միջոցներ', 'Խոսափողներ', 'Տեսասարքերի մալուխներ և ալեհավաքներ',
                        'Տեսասարքերի փոխարկիչներ'
                    ]
                }

            ]
        },
        {
            title: 'Համակարգիչներ, նոթբուքներ, պլանշետներ',
            subMenu: [
                {
                    subTitle: 'Նոթբուքներ',
                    text: [
                        'Օֆիսային նոթբուքներ', 'Դիզայներական նոթբուքներ',
                        'Բիզնես նոթբուքներ', 'Խաղային նոթբուքներ'
                    ]
                },
                {
                    subTitle: 'Հիշողության սարքեր',
                    text: ['HDD, SSD կուտակիչներ', 'Կրիչներ']
                },
                {
                    subTitle: 'Պլանշետներ եվ Էլեկտրոնային գրքերի ընթերցիչներ',
                    text: ['Պլանշետներ', 'Գրաֆիկական պլանշետներ',
                        'Էլեկտրոնային գրքերի ընթերցիչներ (Kindle)']
                },
                {
                    subTitle: 'Համակարգչային սարքավորումներ',
                    text: [
                        'Ստեղնաշարներ և կոմպլեկտներ', 'Մկնիկներ',
                        'WEB տեսախցիկներ', 'Էլեկտրոնային գրիչներ',
                        'Նոութբուքի հովացուցիչներ', 'Մկնիկի գորգեր',
                        'Խաղային աթոռներ', 'Համակարգչային խոսափողներ']
                },
                {
                    subTitle: 'Apple',
                    text: [
                        'iMac', 'MacBook', 'iPad', 'iPad-ի պատյաններ',
                        'AirTag', 'Ստեղնաշարներ', 'Մոնիտորներ', 'Լիցքավորիչներ']
                },
                {
                    subTitle: 'Պերեֆերիկ սարքեր',
                    text: ['Տպիչներ', 'Բազմաֆունկցիոնալ տպիչներ', 'Սկաներներ']

                },
                {
                    subTitle: 'Բարձրախոսներ',
                    text: ['Համակարգչային բարձրախոսներ', 'Շարժական բարձրախոսներ']

                },
                {
                    subTitle: 'Աքսեսուարներ',
                    text: [
                        'Ցանցային սարքավորումներ', 'Պատյաններ', 'Պայուսակներ',
                        'Համակարգչային մալուխներ և փոխարկիչներ', 'Լիցքավորման սարքեր', 'Այլ պարագաներ'
                    ]

                },


            ]
        },
        {
            title: 'Հեռախոսներ և կապի միջոցներ',
            subMenu: [
                {
                    subTitle: 'Հեռախոսներ ',
                    text: ['Սմարթֆոններ', 'Ստեղնաշարային հեռախոսներ']
                },
                {
                    subTitle: 'Սմարթ ժամացույցներ',
                    text: ['Սմարթ ժամացույցներ', 'Սմարթ ժամացույցի պարագաներ']
                },
                {
                    subTitle: 'Տնային հեռախոսներ',
                    text: ['Լարով հեռախոսներ', 'Անլար DECT հեռախոսներ']
                },
                {
                    subTitle: 'Աքսեսուարներ',
                    text: [
                        'Հիշողության քարտեր', 'Հեռախոսի պատյաններ',
                        'Էկրանի պաշտպանիչ թաղանթներ', 'Մոնոպոդներ (selfie-ձողեր)',
                        'Արտաքին մարտկոցներ (Power bank)', 'Անլար լիցքավորիչներ',
                        'Լիցքավորման սարքեր', 'Բջջային հեռախոսի մալուխներ']
                },
                {
                    subTitle: 'Apple',
                    text: [
                        'iPhone', 'iWatch', 'AirPods', 'AirPods-ի պարագաներ',
                        'Պատյաններ', 'Դրամապանակ', 'Լիցքավորիչներ', 'Մալուխներ և փոխարկիչներ',
                        'AirTag', 'Smart TV համակարգեր']
                },
                {
                    subTitle: 'Ականջակալներ ',
                    text: ['Ականջակալներ', 'Անլար ականջակալներ (True Wireless)', 'Bluetooth ականջակալներ']

                },

            ]
        },
        {
            title: 'Կենցաղային տեխնիկա',
            subMenu: [
                {
                    subTitle: 'Հեռախոսներ ',
                    text: ['Սմարթֆոններ', 'Ստեղնաշարային հեռախոսներ',
                        'Սմարթ ժամացույցներ', 'Սմարթ ժամացույցի պարագաներ']
                },

                {
                    subTitle: 'Տնային հեռախոսներ',
                    text: ['Լարով հեռախոսներ', 'Անլար DECT հեռախոսներ', 'Ականջակալներ',
                        'Անլար ականջակալներ (True Wireless)', 'Bluetooth ականջակալներ']
                },
                {
                    subTitle: 'Աքսեսուարներ',
                    text: [
                        'Հիշողության քարտեր', 'Հեռախոսի պատյաններ',
                        'Էկրանի պաշտպանիչ թաղանթներ', 'Մոնոպոդներ (selfie-ձողեր)',
                        'Արտաքին մարտկոցներ (Power bank)', 'Անլար լիցքավորիչներ',
                        'Լիցքավորման սարքեր', 'Բջջային հեռախոսի մալուխներ']
                },
                {
                    subTitle: 'Apple',
                    text: [
                        'iPhone', 'iWatch', 'AirPods', 'AirPods-ի պարագաներ',
                        'Պատյաններ', 'Դրամապանակ', 'Լիցքավորիչներ', 'Մալուխներ և փոխարկիչներ',
                        'AirTag', 'Smart TV համակարգեր']
                },


            ]
        },
        {
            title: 'Խոհանոցային տեխնիկա',
            subMenu: [
                {
                    subTitle: 'Նոթբուքներ',
                    text: [
                        'Օֆիսային նոթբուքներ', 'Դիզայներական նոթբուքներ',
                        'Բիզնես նոթբուքներ', 'Խաղային նոթբուքներ'
                    ]
                },
                {
                    subTitle: 'Հիշողության սարքեր',
                    text: ['HDD, SSD կուտակիչներ', 'Կրիչներ']
                },
                {
                    subTitle: 'Պլանշետներ եվ Էլեկտրոնային գրքերի ընթերցիչներ',
                    text: ['Պլանշետներ', 'Գրաֆիկական պլանշետներ',
                        'Էլեկտրոնային գրքերի ընթերցիչներ (Kindle)']
                },
                {
                    subTitle: 'Համակարգչային սարքավորումներ',
                    text: [
                        'Ստեղնաշարներ և կոմպլեկտներ', 'Մկնիկներ',
                        'WEB տեսախցիկներ', 'Էլեկտրոնային գրիչներ',
                        'Նոութբուքի հովացուցիչներ', 'Մկնիկի գորգեր',
                        'Խաղային աթոռներ', 'Համակարգչային խոսափողներ']
                },
                {
                    subTitle: 'Apple',
                    text: [
                        'iMac', 'MacBook', 'iPad', 'iPad-ի պատյաններ',
                        'AirTag', 'Ստեղնաշարներ', 'Մոնիտորներ', 'Լիցքավորիչներ']
                },
                {
                    subTitle: 'Պերեֆերիկ սարքեր',
                    text: ['Տպիչներ', 'Բազմաֆունկցիոնալ տպիչներ', 'Սկաներներ']

                },
                {
                    subTitle: 'Բարձրախոսներ',
                    text: ['Համակարգչային բարձրախոսներ', 'Շարժական բարձրախոսներ']

                },
                {
                    subTitle: 'Աքսեսուարներ',
                    text: [
                        'Ցանցային սարքավորումներ', 'Պատյաններ', 'Պայուսակներ',
                        'Համակարգչային մալուխներ և փոխարկիչներ', 'Լիցքավորման սարքեր', 'Այլ պարագաներ'
                    ]

                },


            ]
        },
        {
            title: 'Կլիմատիկ տեխնիկա',
            subMenu: [
                {
                    subTitle: 'Հեռուստացույցներ',
                    text: [
                        'UHD (4K) հեռուստացույցներ', 'UHD (4K) հեռուստացույցներ',
                        'Smart հեռուստացույցներ', 'QLED հեռուստացույցներ', 'OLED հեռուստացույցներ',
                        'NanoCell հեռուստացույցներ', 'QNED հեռուստացույցներ'

                    ]
                },
                {
                    subTitle: 'Պրոյեկտորներ և աքսեսուարներ',
                    text: [
                        'Պրոյեկտորներ', 'Պրոյեկտորի աքսեսուարներ/Տեսապրոյեկտորների էկրաններ',
                        'Հեռակառավարման վահանակներ']
                },
                {
                    subTitle: 'Տնային կինոթատրոններ և սաունդբարեր',
                    text: ['Սաունդբարեր', 'Տնային կինոթատրոններ']
                },
                {
                    subTitle: 'Երաժշտական կենտրոններ, MP3 նվագարկիչներ, ձայնագրիչներ',
                    text: [
                        'Երաժշտական կենտրոններ Midi', 'Երաժշտական կենտրոններ Micro',
                        'Երաժշտական կենտրոններ Micro', 'Երաժշտական կենտրոններ Mini',
                        'Վինիլային սկավառակի նվագարկիչներ']
                },
                {
                    subTitle: 'Ակուստիկա և բարձրախոսներ',
                    text: [
                        'Ակուստիկա', 'Համակարգային բարձրախոսներ', 'Շարժական բարձրախոսներ',
                        'Ընդունիչներ']
                },
                {
                    subTitle: 'Թվային հեռուստատեսություն և պարագաներ',
                    text: ['DVB-T2 ընդունիչներ', 'Smart TV համակարգեր', 'Տակդիրներ',
                        'Հենակներ', 'Հեռակառավարման վահանակներ', 'Աուդիո տեխնիկայի փոխարկիչներ',
                        'Մաքրող միջոցներ', 'Խոսափողներ', 'Տեսասարքերի մալուխներ և ալեհավաքներ',
                        'Տեսասարքերի փոխարկիչներ'
                    ]
                }

            ]
        },


    ];


    brandImgs = ['https://www.zigzag.am/pub/media/categories/miele.svg',
        'https://www.zigzag.am/pub/media/categories/bosch.svg',
        'https://www.zigzag.am/pub/media/categories/k-array.svg']



}